job("Счетовод").
job("Бугалтер").
job("Кассир").

jobs("Митерев", V1, "Набатов", V3):-
    V3 = "Кассир", !,
    V1 = "Счетовод".

jobs("Митерев", V1, "Набатов", V3):-
    V3 = "Счетовод", !,
    V1 = "Бугалтер".

jobs("Митерев", V1, "Левин", V2):-
    V1 \= "Кассир", !,
    V2 \= "Счетовод".

jobs("Левин", V2,  "Набатов", V3):-
    V2 = "Бугалтер", !,
    V3 = "Счетовод".

jobs(_, V1,  _, V2):-
    V1 \= V2.

res():-
    job(V1),
    job(V2),
    job(V3),
    V1 \= V2,
    V1 \= V3,
    V2 \= V3,
    jobs("Митерев", V1, "Левин", V2),
    jobs("Левин", V2,  "Набатов", V3),
    jobs("Митерев", V1, "Набатов", V3), !,
    write("Митерев"), tab(1), write(V1), nl,
    write("Левин"), tab(1), write(V2), nl,
    write("Набатов"), tab(1), write(V3), nl.
