male("Александр Игоревич Гамов").
male("Марк Александрович Гамов").
male("Филипп Александрович Гамов").
male("Игорь Павлович Гершман").
male("Антон Игоревич Гамов").
male("Михаил Иванович Гамов").
male("Геннадий Моисеевич Гурьев").
male("Максим Геннадьевич Гурьев").
male("Павел Антонович Гамов").
male("Павел Исаевич Гершман").
male("Олег Павлович Гершман").
male("Иван Петрович Гамов").
male("Василий Егорович Ходорев").
male("Пётр Руднев").
male("Анатолий Петрович Руднев").
male("Виталий Петрович Руднев").
male("Игорь Александрович Солошенко").
male("Лев Владимирович Канунников").
male("Игорь Игоревич Солошенко").
male("Алексей Селезнев").
male("Иван").
male("Моисей Гурьев").
male("Николай Иванович Гамов").
male("Иван Иванович Гамов").
male("Василий Иванович Бронников").
male("Иван Бронников").
male("Василий Иванович Виноградов").
male("Сергей Васильевич Виноградов").
male("Иван Виноградов").
male("Василий Васильевич Бронников").
male("Вадим Игоревич Орлов").
male("Борис Михайлович Пономарев").
male("Андрей Батырев").
male("Антон Андреевич Батырев").
male("Тимофей").
male("Алон").
male("Исай Григорьевич Гершман").
male("Григорий Гершман").
male("Леонид Исаевич Гершман").
male("Иван Неделин").
male("Петр Гамов").
male("Николай Анатольевич Руднев").
male("Лев").
male("Геннадий").
male("Вячеслав Геннадьевич").
male("Егор Ходорев").
male("Стефан Иванович Воробьев").
male("Александр").
male("Игорь Александрович").
male("Геннадий Игоревич").
male("Алексей Стефанович Воробьев").
male("Михаил Стефанович Воробьев").
male("Игорь Михайлович Воробьев").
male("Сергей Михайлович Воробьев").
male("Георгий").
male("Александр Кочкин").
male("Андрей Александрович Кочкин").
male("Кирилл Андреевич Кочкин").
male("Матвей Андреевич Кочкин").
male("Иван").
male("Виктор Маруняк").
male("Вячеслав Викторович Маруняк").
male("Константин Васильевич Ходорев").
male("Николай Васильевич Ходорев").
male("Василий Николаевич Ходорев").
male("Валерий Васильевич Ходорев").
male("Николай Васильевич Ходорев").
male("Анатолий Николаевич Ходорев").
male("Илья Александрович Гамов").
male("Владимир Иванович Канунников").
male("Иван Павлович Семененко").
male("Александр Тимофеевич Солошенко").
male("Владимир Львович Канунников").
male("Андрей Лесун").
male("Кирилл Воронцов").
male("Игорь Сергеевич Проскуряков").
male("Евгений Алексеевич Черкашин").
male("Евгений Александрович Бородин").
male("Александр Бородин").
male("Влад Бородин").
male("Алексей Иванович Черкашин").
male("Иван Федорович Черкашин").
male("Александр Воронцов").
male("Иван Иванович Меркушев").
male("Павел Семененко").
male("Сергей Петрович Проскуряков").
male("Олег Сергеевич Проскуряков").
male("Юрий Сергеевич Проскуряков").
male("Прокофий Павлович Семененко").
male("Григорий Павлович Семененко").
male("Илья павлович Семененко").
male("Василий Павлович Семененко").
male("Алексей Алексеевич Румянцев").
male("Федор Петрович Комаров").
male("Алексей Румянцев").
male("Павел Федорович Комаров").

female("Мария Игоревна Солошенко").
female("Нина Михайловна Гамова").
female("Екатерина Игоревна Гершман").
female("Антонина Васильевна Ходорева").
female("Нонна Михайловна Гамова").
female("Римма Михайловна Гамова").
female("Маргарита Геннадьевна Гурьева").
female("Ольга Алексеевна Селезнева").
female("Марина Антоновна Гамова").
female("Галина Васильевна Бронникова").
female("Людмила Павловна Гершман").
female("Анисья Ивановна Неделина").
female("Елизавета Андреевна Неизвестна").
female("Мария Ивановна Гамова").
female("Октябрина").
female("Марина Анатольевна Руднева").
female("Ирина Львовна Канунникова").
female("Татьяна").
female("Екатерина Васильевна Виноградова").
female("Елизавета Васильевна Виноградова").
female("Дина").
female("Наталья Олеговна Гершман").
female("Лидия Олеговна Гершман").
female("Галина Олеговна Гершман").
female("Надежда Борисовна Пономарева").
female("Анна Андреевна Батырева").
female("Валентина Борисовна Пономарева").
female("Кира").
female("Софья").
female("Анна Исаевна Гершман").
female("Галина Исаевна Гершман").
female("Мина Исаевна Гершман").
female("Рива Исаевна Гершман").
female("Татьяна Гершман").
female("Акулина").
female("Нонна Константиновна").
female("Алла Николаевна Гамова").
female("Антонина Ивановна Гамова").
female("Нина Львовна Гамова").
female("Надежда Васильевна Ходорева").
female("Валентина Стефановна Воробьева").
female("Нонна Александровна").
female("Александра").
female("Мария").
female("Вера").
female("Мария").
female("Нина Васильевна Ходорева").
female("Алла Георгиевна").
female("Вера Александровна Кочкина").
female("Елена").
female("Александра Васильевна Ходорева").
female("Любовь Михайловна").
female("Акулина").
female("Светлана Контантиновна Ходорева").
female("Тамара Константиновна Ходорева").
female("Екатерина").
female("Ольга").
female("Валентина").
female("Елена Анатольевна Ходорева").
female("Татьяна Анатольевна Ходорева").
female("Адель Ивановна Семененко").
female("Татьяна Ивановна").
female("Александра Юлиановна Громова").
female("Евгения Сергеевна Тыщенко").
female("Екатерина Руссу").
female("Ульяна Антоновна Гамова").
female("Ульяна Львовна Канунникова").
female("Елена Львовна Канунникова").
female("Анна Игоревна Проскурякова").
female("Александра Русинова").
female("Екатерина Евгеньевна Черкашина").
female("Валентина Ивановна Меркушева").
female("Анна Прокопьевна").
female("Полина Александровна Воронцова").
female("Анастасия Николаевна").
female("Наталья Егоровна").
female("Валентина Степановна").
female("Анна").
female("Елена Проскурякова").
female("Татьяна Проскурякова").
female("Феодосия Ивановна").
female("Валентина Федоровна Комарова").
female("Александра Яковлевна").
female("Анастасия Гущина").
female("София Сергеевна Гурьева").

children("Марк Александрович Гамов", "Александр Игоревич Гамов").
children("Филипп Александрович Гамов", "Александр Игоревич Гамов").
children("Илья Александрович Гамов", "Александр Игоревич Гамов").
children("Марк Александрович Гамов", "Мария Игоревна Солошенко").
children("Филипп Александрович Гамов", "Мария Игоревна Солошенко").
children("Илья Александрович Гамов", "Мария Игоревна Солошенко").
children("Вадим Игоревич Орлов", "Игорь Павлович Гершман").
children("Екатерина Игоревна Гершман", "Игорь Павлович Гершман").
children("Александр Игоревич Гамов", "Игорь Павлович Гершман").
children("Антон Игоревич Гамов", "Игорь Павлович Гершман").
children("Вадим Игоревич Орлов", "Нина Михайловна Гамова").
children("Екатерина Игоревна Гершман", "Нина Михайловна Гамова").
children("Александр Игоревич Гамов", "Нина Михайловна Гамова").
children("Антон Игоревич Гамов", "Нина Михайловна Гамова").
children("Нина Михайловна Гамова", "Михаил Иванович Гамов").
children("Нонна Михайловна Гамова", "Михаил Иванович Гамов").
children("Римма Михайловна Гамова", "Михаил Иванович Гамов").
children("Нина Михайловна Гамова", "Антонина Васильевна Ходорева").
children("Нонна Михайловна Гамова", "Антонина Васильевна Ходорева").
children("Римма Михайловна Гамова", "Антонина Васильевна Ходорева").
children("Маргарита Геннадьевна Гурьева", "Геннадий Моисеевич Гурьев").
children("Максим Геннадьевич Гурьев", "Геннадий Моисеевич Гурьев").
children("Маргарита Геннадьевна Гурьева", "Римма Михайловна Гамова").
children("Максим Геннадьевич Гурьев", "Римма Михайловна Гамова").
children("Павел Антонович Гамов", "Антон Игоревич Гамов").
children("Марина Антоновна Гамова", "Антон Игоревич Гамов").
children("Ульяна Антоновна Гамова", "Антон Игоревич Гамов").
children("Павел Антонович Гамов", "Ольга Алексеевна Селезнева").
children("Марина Антоновна Гамова", "Ольга Алексеевна Селезнева").
children("Ульяна Антоновна Гамова", "Ольга Алексеевна Селезнева").
children("Игорь Павлович Гершман", "Павел Исаевич Гершман").
children("Олег Павлович Гершман", "Павел Исаевич Гершман").
children("Людмила Павловна Гершман", "Павел Исаевич Гершман").
children("Игорь Павлович Гершман", "Галина Васильевна Бронникова").
children("Олег Павлович Гершман", "Галина Васильевна Бронникова").
children("Людмила Павловна Гершман", "Галина Васильевна Бронникова").
children("Михаил Иванович Гамов", "Иван Петрович Гамов").
children("Мария Ивановна Гамова", "Иван Петрович Гамов").
children("Николай Иванович Гамов", "Иван Петрович Гамов").
children("Иван Иванович Гамов", "Иван Петрович Гамов").
children("Антонина Ивановна Гамова", "Иван Петрович Гамов").
children("Михаил Иванович Гамов", "Анисья Ивановна Неделина").
children("Мария Ивановна Гамова", "Анисья Ивановна Неделина").
children("Николай Иванович Гамов", "Анисья Ивановна Неделина").
children("Иван Иванович Гамов", "Анисья Ивановна Неделина").
children("Антонина Ивановна Гамова", "Анисья Ивановна Неделина").
children("Антонина Васильевна Ходорева", "Василий Егорович Ходорев").
children("Надежда Васильевна Ходорева", "Василий Егорович Ходорев").
children("Нина Васильевна Ходорева", "Василий Егорович Ходорев").
children("Александра Васильевна Ходорева", "Василий Егорович Ходорев").
children("Константин Васильевич Ходорев", "Василий Егорович Ходорев").
children("Николай Васильевич Ходорев", "Василий Егорович Ходорев").
children("Антонина Васильевна Ходорева", "Елизавета Андреевна Неизвестна").
children("Надежда Васильевна Ходорева", "Елизавета Андреевна Неизвестна").
children("Нина Васильевна Ходорева", "Елизавета Андреевна Неизвестна").
children("Александра Васильевна Ходорева", "Елизавета Андреевна Неизвестна").
children("Константин Васильевич Ходорев", "Елизавета Андреевна Неизвестна").
children("Николай Васильевич Ходорев", "Елизавета Андреевна Неизвестна").
children("Виталий Петрович Руднев", "Пётр Руднев").
children("Анатолий Петрович Руднев", "Пётр Руднев").
children("Виталий Петрович Руднев", "Мария Ивановна Гамова").
children("Анатолий Петрович Руднев", "Мария Ивановна Гамова").
children("Марина Анатольевна Руднева", "Анатолий Петрович Руднев").
children("Николай Анатольевич Руднев", "Анатолий Петрович Руднев").
children("Марина Анатольевна Руднева", "Октябрина").
children("Николай Анатольевич Руднев", "Октябрина").
children("Мария Игоревна Солошенко", "Игорь Александрович Солошенко").
children("Игорь Игоревич Солошенко", "Игорь Александрович Солошенко").
children("Мария Игоревна Солошенко", "Ирина Львовна Канунникова").
children("Игорь Игоревич Солошенко", "Ирина Львовна Канунникова").
children("Владимир Львович Канунников", "Лев Владимирович Канунников").
children("Ирина Львовна Канунникова", "Лев Владимирович Канунников").
children("Елена Львовна Канунникова", "Лев Владимирович Канунников").
children("Ульяна Львовна Канунникова", "Лев Владимирович Канунников").
children("Владимир Львович Канунников", "Адель Ивановна Семененко").
children("Ирина Львовна Канунникова", "Адель Ивановна Семененко").
children("Елена Львовна Канунникова", "Адель Ивановна Семененко").
children("Ульяна Львовна Канунникова", "Адель Ивановна Семененко").
children("Ольга Алексеевна Селезнева", "Алексей Селезнев").
children("Ольга Алексеевна Селезнева", "Татьяна").
children("Татьяна", "Иван").
children("Геннадий Моисеевич Гурьев", "Моисей Гурьев").
children("Галина Васильевна Бронникова", "Василий Иванович Бронников").
children("Галина Васильевна Бронникова", "Екатерина Васильевна Виноградова").
children("Василий Иванович Бронников", "Иван Бронников").
children("Екатерина Васильевна Виноградова", "Василий Иванович Виноградов").
children("Сергей Васильевич Виноградов", "Василий Иванович Виноградов").
children("Елизавета Васильевна Виноградова", "Василий Иванович Виноградов").
children("Василий Иванович Виноградов", "Иван Виноградов").
children("Василий Васильевич Бронников", "Василий Иванович Бронников").
children("Василий Васильевич Бронников", "Елизавета Васильевна Виноградова").
children("Наталья Олеговна Гершман", "Олег Павлович Гершман").
children("Галина Олеговна Гершман", "Олег Павлович Гершман").
children("Лидия Олеговна Гершман", "Олег Павлович Гершман").
children("Наталья Олеговна Гершман", "Дина").
children("Галина Олеговна Гершман", "Дина").
children("Лидия Олеговна Гершман", "Дина").
children("Надежда Борисовна Пономарева", "Борис Михайлович Пономарев").
children("Валентина Борисовна Пономарева", "Борис Михайлович Пономарев").
children("Надежда Борисовна Пономарева", "Людмила Павловна Гершман").
children("Валентина Борисовна Пономарева", "Людмила Павловна Гершман").
children("Анна Андреевна Батырева", "Андрей Батырев").
children("Антон Андреевич Батырев", "Андрей Батырев").
children("Анна Андреевна Батырева", "Надежда Борисовна Пономарева").
children("Антон Андреевич Батырев", "Надежда Борисовна Пономарева").
children("Алон", "Тимофей").
children("Кира", "Тимофей").
children("Алон", "Валентина Борисовна Пономарева").
children("Кира", "Валентина Борисовна Пономарева").
children("Мина Исаевна Гершман", "Исай Григорьевич Гершман").
children("Рива Исаевна Гершман", "Исай Григорьевич Гершман").
children("Павел Исаевич Гершман", "Исай Григорьевич Гершман").
children("Анна Исаевна Гершман", "Исай Григорьевич Гершман").
children("Леонид Исаевич Гершман", "Исай Григорьевич Гершман").
children("Галина Исаевна Гершман", "Исай Григорьевич Гершман").
children("Мина Исаевна Гершман", "Софья").
children("Рива Исаевна Гершман", "Софья").
children("Павел Исаевич Гершман", "Софья").
children("Анна Исаевна Гершман", "Софья").
children("Леонид Исаевич Гершман", "Софья").
children("Галина Исаевна Гершман", "Софья").
children("Исай Григорьевич Гершман", "Григорий Гершман").
children("Татьяна Гершман", "Галина Исаевна Гершман").
children("Анисья Ивановна Неделина", "Иван Неделин").
children("Анисья Ивановна Неделина", "Акулина").
children("Иван Петрович Гамов", "Петр Гамов").
children("Алла Николаевна Гамова", "Николай Иванович Гамов").
children("Алла Николаевна Гамова", "Нонна Константиновна").
children("Нина Львовна Гамова", "Лев").
children("Нина Львовна Гамова", "Антонина Ивановна Гамова").
children("Вячеслав Геннадьевич", "Геннадий").
children("Вячеслав Геннадьевич", "Нина Львовна Гамова").
children("Василий Егорович Ходорев", "Егор Ходорев").
children("Валентина Стефановна Воробьева", "Стефан Иванович Воробьев").
children("Алексей Стефанович Воробьев", "Стефан Иванович Воробьев").
children("Михаил Стефанович Воробьев", "Стефан Иванович Воробьев").
children("Валентина Стефановна Воробьева", "Надежда Васильевна Ходорева").
children("Алексей Стефанович Воробьев", "Надежда Васильевна Ходорева").
children("Михаил Стефанович Воробьев", "Надежда Васильевна Ходорева").
children("Игорь Александрович", "Александр").
children("Нонна Александровна", "Александр").
children("Игорь Александрович", "Валентина Стефановна Воробьева").
children("Нонна Александровна", "Валентина Стефановна Воробьева").
children("Александра", "Нонна Александровна").
children("Мария", "Нонна Александровна").
children("Геннадий Игоревич", "Игорь Александрович").
children("Геннадий Игоревич", "Вера").
children("Игорь Михайлович Воробьев", "Михаил Стефанович Воробьев").
children("Сергей Михайлович Воробьев", "Михаил Стефанович Воробьев").
children("Игорь Михайлович Воробьев", "Мария").
children("Сергей Михайлович Воробьев", "Мария").
children("Алла Георгиевна", "Георгий").
children("Алла Георгиевна", "Нина Васильевна Ходорева").
children("Андрей Александрович Кочкин", "Александр Кочкин").
children("Вера Александровна Кочкина", "Александр Кочкин").
children("Андрей Александрович Кочкин", "Алла Георгиевна").
children("Вера Александровна Кочкина", "Алла Георгиевна").
children("Кирилл Андреевич Кочкин", "Андрей Александрович Кочкин").
children("Матвей Андреевич Кочкин", "Андрей Александрович Кочкин").
children("Кирилл Андреевич Кочкин", "Елена").
children("Матвей Андреевич Кочкин", "Елена").
children("Иван", "Вера Александровна Кочкина").
children("Вячеслав Викторович Маруняк", "Виктор Маруняк").
children("Вячеслав Викторович Маруняк", "Александра Васильевна Ходорева").
children("Светлана Контантиновна Ходорева", "Константин Васильевич Ходорев").
children("Тамара Константиновна Ходорева", "Константин Васильевич Ходорев").
children("Светлана Контантиновна Ходорева", "Акулина").
children("Тамара Константиновна Ходорева", "Акулина").
children("Василий Николаевич Ходорев", "Николай Васильевич Ходорев").
children("Анатолий Николаевич Ходорев", "Николай Васильевич Ходорев").
children("Василий Николаевич Ходорев", "Екатерина").
children("Анатолий Николаевич Ходорев", "Екатерина").
children("Николай Васильевич Ходорев", "Василий Николаевич Ходорев").
children("Валерий Васильевич Ходорев", "Василий Николаевич Ходорев").
children("Николай Васильевич Ходорев", "Ольга").
children("Валерий Васильевич Ходорев", "Ольга").
children("Елена Анатольевна Ходорева", "Анатолий Николаевич Ходорев").
children("Татьяна Анатольевна Ходорева", "Анатолий Николаевич Ходорев").
children("Елена Анатольевна Ходорева", "Валентина").
children("Татьяна Анатольевна Ходорева", "Валентина").
children("Лев Владимирович Канунников", "Владимир Иванович Канунников").
children("Лев Владимирович Канунников", "Татьяна Ивановна").
children("Адель Ивановна Семененко", "Иван Павлович Семененко").
children("Адель Ивановна Семененко", "Александра Юлиановна Громова").
children("Игорь Александрович Солошенко", "Александр Тимофеевич Солошенко").
children("Игорь Александрович Солошенко", "Евгения Сергеевна Тыщенко").
children("Кирилл Воронцов", "Андрей Лесун").
children("Кирилл Воронцов", "Ульяна Львовна Канунникова").
children("Анна Игоревна Проскурякова", "Игорь Сергеевич Проскуряков").
children("Анна Игоревна Проскурякова", "Елена Львовна Канунникова").
children("Екатерина Евгеньевна Черкашина", "Евгений Алексеевич Черкашин").
children("Екатерина Евгеньевна Черкашина", "Елена Львовна Канунникова").
children("Евгений Александрович Бородин", "Александр Бородин").
children("Влад Бородин", "Александр Бородин").
children("Евгений Александрович Бородин", "Александра Русинова").
children("Влад Бородин", "Александра Русинова").
children("Евгений Алексеевич Черкашин", "Алексей Иванович Черкашин").
children("Евгений Алексеевич Черкашин", "Валентина Ивановна Меркушева").
children("Алексей Иванович Черкашин", "Иван Федорович Черкашин").
children("Алексей Иванович Черкашин", "Анна Прокопьевна").
children("Полина Александровна Воронцова", "Александр Воронцов").
children("Полина Александровна Воронцова", "Ульяна Львовна Канунникова").
children("Валентина Ивановна Меркушева", "Иван Иванович Меркушев").
children("Валентина Ивановна Меркушева", "Анастасия Николаевна").
children("Иван Иванович Меркушев", "Наталья Егоровна").
children("Прокофий Павлович Семененко", "Павел Семененко").
children("Иван Павлович Семененко", "Павел Семененко").
children("Григорий Павлович Семененко", "Павел Семененко").
children("Василий Павлович Семененко", "Павел Семененко").
children("Илья павлович Семененко", "Павел Семененко").
children("Прокофий Павлович Семененко", "Феодосия Ивановна").
children("Иван Павлович Семененко", "Феодосия Ивановна").
children("Григорий Павлович Семененко", "Феодосия Ивановна").
children("Василий Павлович Семененко", "Феодосия Ивановна").
children("Илья павлович Семененко", "Феодосия Ивановна").
children("Игорь Сергеевич Проскуряков", "Сергей Петрович Проскуряков").
children("Олег Сергеевич Проскуряков", "Сергей Петрович Проскуряков").
children("Юрий Сергеевич Проскуряков", "Сергей Петрович Проскуряков").
children("Игорь Сергеевич Проскуряков", "Валентина Степановна").
children("Олег Сергеевич Проскуряков", "Валентина Степановна").
children("Юрий Сергеевич Проскуряков", "Валентина Степановна").
children("Сергей Петрович Проскуряков", "Анна").
children("Елена Проскурякова", "Олег Сергеевич Проскуряков").
children("Елена Проскурякова", "Татьяна Проскурякова").
children("Алексей Алексеевич Румянцев", "Прокофий Павлович Семененко").
children("Алексей Алексеевич Румянцев", "Валентина Федоровна Комарова").
children("Валентина Федоровна Комарова", "Федор Петрович Комаров").
children("Павел Федорович Комаров", "Федор Петрович Комаров").
children("Валентина Федоровна Комарова", "Александра Яковлевна").
children("Павел Федорович Комаров", "Александра Яковлевна").
children("София Сергеевна Гурьева", "Маргарита Геннадьевна Гурьева").
